<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7aa56b9b609ffb01fd9b20344e5c23d1806cafe67341e1f865e0560409af961f","plan_job_ref":"Job PR Plan #13 at https://github.com/tyng94/tyng94/actions/runs/6986292114","plan_hash":"9f80cd04027300b272c7dc9c421f7f597e21c0ca9ed39e292623eeab06903c1a","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in ___infrastructure__
<details>
<summary>Plan: 1 to add, 1 to change, 4 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_access_key.continuous_integration will be destroyed
  # (because aws_iam_access_key.continuous_integration is not in configuration)
  - resource "aws_iam_access_key" "continuous_integration" {
      - create_date = "2023-11-24T16:49:52Z" -> null
      - id          = "AKIA3BAVR6A247ACKKHY" -> null
      - status      = "Active" -> null
      - user        = "CI" -> null
    }

  # aws_iam_openid_connect_provider.default must be replaced
-/+ resource "aws_iam_openid_connect_provider" "default" {
      ~ arn             = "arn:aws:iam::758106943541:oidc-provider/token.actions.githubusercontent.com" -> (known after apply)
      ~ client_id_list  = [ # forces replacement
          - "sts.amazonaws.com",
          + "sts.amazonaws.com.",
        ]
      ~ id              = "***************************************************************************" -> (known after apply)
      - tags            = {} -> null
      ~ tags_all        = {} -> (known after apply)
      ~ url             = "token.actions.githubusercontent.com" -> "https://token.actions.githubusercontent.com"
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.terraformer will be updated in-place
  ~ resource "aws_iam_role" "terraformer" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "*****************"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "********************"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::758106943541:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "terraformer"
        name                  = "terraformer"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_user.continuous_integration will be destroyed
  # (because aws_iam_user.continuous_integration is not in configuration)
  - resource "aws_iam_user" "continuous_integration" {
      - arn           = "arn:aws:iam::758106943541:user/CI" -> null
      - force_destroy = false -> null
      - id            = "CI" -> null
      - name          = "CI" -> null
      - path          = "/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDA3BAVR6A267UMIOWC6" -> null
    }

  # aws_iam_user_policy_attachment.continuous_integration_policies will be destroyed
  # (because aws_iam_user_policy_attachment.continuous_integration_policies is not in configuration)
  - resource "aws_iam_user_policy_attachment" "continuous_integration_policies" {
      - id         = "CI-20231124180549021600000001" -> null
      - policy_arn = "arn:aws:iam::758106943541:policy/terraform-base-policy" -> null
      - user       = "CI" -> null
    }

Plan: 1 to add, 1 to change, 4 to destroy.
```
</details>

:memo: Plan generated in [PR Plan #13](https://github.com/tyng94/tyng94/actions/runs/6986292114)